; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v1)
		(pred_4 ?v5)
		(pred_2 ?v8)
		(pred_1 ?v8)
		(pred_6 ?v5 ?v8)
		(pred_3)
		(pred_5 ?v5))

   (:action op_3
       :parameters  (?v3 ?v6)
       :precondition (and (not-eq ?v3 ?v6) 
                          (pred_2 ?v3) (pred_2 ?v6) (pred_1 ?v3))
       :effect (and  (pred_1 ?v6)
		     (not (pred_1 ?v3))))


   (:action op_1
       :parameters (?v4 ?v2)
       :precondition  (and  (pred_4 ?v4) (pred_2 ?v2)
			    (pred_6 ?v4 ?v2) (pred_1 ?v2) (pred_3))
       :effect (and (pred_5 ?v4)
		    (not (pred_6 ?v4 ?v2)) 
		    (not (pred_3))))

   (:action op_2
       :parameters  (?v4  ?v2)
       :precondition  (and  (pred_4 ?v4) (pred_2 ?v2)
			    (pred_5 ?v4) (pred_1 ?v2))
       :effect (and (pred_6 ?v4 ?v2)
		    (pred_3)
		    (not (pred_5 ?v4)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects obj_05 obj_04 obj_03 
          obj_01 obj_02 
)
(:init
(pred_2 obj_05)
(pred_2 obj_04)
(pred_2 obj_03)
(pred_4 obj_01)
(pred_4 obj_02)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(pred_3)
(pred_6 obj_01 obj_04)
(pred_6 obj_02 obj_04)
(pred_1 obj_04)
)
(:goal
(and
(pred_6 obj_01 obj_05)
(pred_6 obj_02 obj_03)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_01 obj_05) (pred_1 obj_03))
    (sometime-before  (pred_6 obj_02 obj_03) (pred_1 obj_05))
  )
)
)

; plan
1. (op_1 obj_01 obj_04)
   deleted: (pred_6 obj_01 obj_04) (pred_3)
   added: (pred_5 obj_01)
   goals met: 0 of 2
2. (op_3 obj_04 obj_03)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_03)
   goals met: 0 of 2
3. (op_2 obj_01 obj_03)
   deleted: (pred_5 obj_01)
   added: (pred_6 obj_01 obj_03) (pred_3)
   goals met: 0 of 2
4. (op_3 obj_03 obj_04)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_04)
   goals met: 0 of 2
5. (op_1 obj_02 obj_04)
   deleted: (pred_6 obj_02 obj_04) (pred_3)
   added: (pred_5 obj_02)
   goals met: 0 of 2
6. (op_3 obj_04 obj_03)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_03)
   goals met: 0 of 2
7. (op_3 obj_03 obj_05)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_05)
   goals met: 0 of 2
8. (op_2 obj_02 obj_05)
   deleted: (pred_5 obj_02)
   added: (pred_6 obj_02 obj_05) (pred_3)
   goals met: 0 of 2
9. (op_3 obj_05 obj_03)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_03)
   goals met: 0 of 2
10. (op_1 obj_01 obj_03)
   deleted: (pred_6 obj_01 obj_03) (pred_3)
   added: (pred_5 obj_01)
   goals met: 0 of 2
11. (op_3 obj_03 obj_05)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_05)
   goals met: 0 of 2
12. (op_2 obj_01 obj_05)
   deleted: (pred_5 obj_01)
   added: (pred_6 obj_01 obj_05) (pred_3)
   goals met: 1 of 2
13. (op_1 obj_02 obj_05)
   deleted: (pred_6 obj_02 obj_05) (pred_3)
   added: (pred_5 obj_02)
   goals met: 1 of 2
14. (op_3 obj_05 obj_03)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_03)
   goals met: 1 of 2
15. (op_2 obj_02 obj_03)
   deleted: (pred_5 obj_02)
   added: (pred_6 obj_02 obj_03) (pred_3)
   goals met: 2 of 2
